app/views/orders/index.html.erb

SELECT "companies".* FROM "companies"
---

	<% Company.all.each do |company| %>

SELECT "orders".* FROM "orders" WHERE "orders"."company_id" = ?  [["company_id", 1]]
---
	<div>
		<% if company.orders.blank? %>

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 1]]
---
				</th>
				<% order.line_items.each do |order| %>