app/controllers/orders_controller.rb

	def create
		@company = Company.find_or_create_by(name: params[:company][:name])
		if @company.valid?
			orders_file_data = params[:company][:orders]
			if orders_file_data.present?
				#TODO In future do this asynchronously
				order = Order.create
				order.extract_line_items(orders_file_data)
				@company.orders << order
				@company.save
---
INSERT INTO "companies" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 05 Apr 2014 03:28:15 UTC +00:00], ["name", "xxx"], ["updated_at", Sat, 05 Apr 2014 03:28:15 UTC +00:00]]
SELECT "companies".* FROM "companies" WHERE "companies"."name" IS NULL LIMIT 1
INSERT INTO "orders" ("company_id", "created_at", "purchaser_name", "updated_at") VALUES (?, ?, ?, ?)  [["company_id", 1], ["created_at", Sat, 05 Apr 2014 04:32:44 UTC +00:00], ["purchaser_name", "Snake Plissken"], ["updated_at", Sat, 05 Apr 2014 04:32:44 UTC +00:00]]
UPDATE "orders" SET "company_id" = ?, "updated_at" = ? WHERE "orders"."id" = 1  [["company_id", 2], ["updated_at", Sat, 05 Apr 2014 05:11:01 UTC +00:00]]